In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.sql import text
import psycopg2
import Config

df_ny = pd.read_csv("C:/Users/micha/PycharmProjects/Docs/MTA_Monthly_Ridership___Traffic_Data__Beginning_January_2008.csv")
df_ch = pd.read_csv("C:/Users/micha/PycharmProjects/Docs/CTA_-_Ridership_-_Daily_Boarding_Totals_20240307.csv")

DB_NAME = "Public_Transit"
DB_USER = "postgres"
DB_PASS = Config.auth
DB_HOST = "localhost"
DB_PORT = "5432"

engine = create_engine(f"postgresql+psycopg2://{DB_USER}:{DB_PASS}@{DB_HOST}/{DB_NAME}")
print(engine)

conn = engine.connect()
print(conn)
df_ch.head()
# df_ny.head()

Engine(postgresql+psycopg2://postgres:***@localhost/Public_Transit)
<sqlalchemy.engine.base.Connection object at 0x000001FA13693D50>

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032
4   01/05/2001        W  890426          557917      1448343

In [2]:
df_ch.dropna(inplace=True)
df_ch.drop_duplicates(inplace=True)
del df_ch['day_type']
del df_ch['total_rides']
df_ch = df_ch.rename(columns={'service_date':'date','rail_boardings': 'metro'})

In [3]:

display(df_ch)

            date     bus   metro
0     01/01/2001  297192  126455
1     01/02/2001  780827  501952
2     01/03/2001  824923  536432
3     01/04/2001  870021  550011
4     01/05/2001  890426  557917
...          ...     ...     ...
8396  10/27/2023  503840  373004
8397  10/28/2023  360484  275006
8398  10/29/2023  250473  185823
8399  10/30/2023  551840  367453
8400  10/31/2023  520069  390110

[8339 rows x 3 columns]

In [4]:
# df_ny.dropna(inplace=True)
# df_ny.drop_duplicates(inplace=True)
# display(df_ny)
df_ny['Agency'].value_counts()

Agency
B&T       190
MNR       180
Bus        73
Subway     73
AAR        61
LIRR       58
SIR        13
Name: count, dtype: int64

In [5]:
metro = ['Subway', 'MNR', 'LIRR', 'SIR']
bus = ['Bus', 'AAR']
df_ny['city'] = 'NYC'

In [6]:
def agency_decide(agency):
    if agency in metro:
        return 'metro';
    else:
        return 'bus'

In [7]:
df_ny['transport type'] = df_ny['Agency'].apply(agency_decide)
df_ny.head()

        Month Agency  Ridership city transport type
0  01/01/2008    MNR    6453734  NYC          metro
1  02/01/2008    MNR    6144377  NYC          metro
2  03/01/2008    MNR    6602280  NYC          metro
3  04/01/2008    MNR    6787480  NYC          metro
4  04/01/2008    B&T   24900328  NYC            bus

In [8]:
df_ny = df_ny.rename(columns={
    'Month': 'date',
    'Agency': 'agency',
    'Ridership': 'ridership',
    'transport type':'transport_type'
    })
    
del df_ny['agency']
df_ny

           date  ridership city transport_type
0    01/01/2008    6453734  NYC          metro
1    02/01/2008    6144377  NYC          metro
2    03/01/2008    6602280  NYC          metro
3    04/01/2008    6787480  NYC          metro
4    04/01/2008   24900328  NYC            bus
..          ...        ...  ...            ...
643  01/01/2024    5490105  NYC          metro
644  01/01/2024     928328  NYC            bus
645  01/01/2024     189970  NYC          metro
646  01/01/2024   24912126  NYC            bus
647  01/01/2024   25395118  NYC            bus

[648 rows x 4 columns]

In [9]:
df_ch

            date     bus   metro
0     01/01/2001  297192  126455
1     01/02/2001  780827  501952
2     01/03/2001  824923  536432
3     01/04/2001  870021  550011
4     01/05/2001  890426  557917
...          ...     ...     ...
8396  10/27/2023  503840  373004
8397  10/28/2023  360484  275006
8398  10/29/2023  250473  185823
8399  10/30/2023  551840  367453
8400  10/31/2023  520069  390110

[8339 rows x 3 columns]

In [10]:
melt_df = df_ch.melt(id_vars='date',value_vars=['bus','metro'],var_name='transport_type',value_name='ridership')

In [11]:
melt_df['city'] = 'Chicago'
melt_df

             date transport_type  ridership     city
0      01/01/2001            bus     297192  Chicago
1      01/02/2001            bus     780827  Chicago
2      01/03/2001            bus     824923  Chicago
3      01/04/2001            bus     870021  Chicago
4      01/05/2001            bus     890426  Chicago
...           ...            ...        ...      ...
16673  10/27/2023          metro     373004  Chicago
16674  10/28/2023          metro     275006  Chicago
16675  10/29/2023          metro     185823  Chicago
16676  10/30/2023          metro     367453  Chicago
16677  10/31/2023          metro     390110  Chicago

[16678 rows x 4 columns]

In [12]:
ny_cleaned = df_ny.copy()
ch_cleaned = melt_df.copy()
ch_cleaned

             date transport_type  ridership     city
0      01/01/2001            bus     297192  Chicago
1      01/02/2001            bus     780827  Chicago
2      01/03/2001            bus     824923  Chicago
3      01/04/2001            bus     870021  Chicago
4      01/05/2001            bus     890426  Chicago
...           ...            ...        ...      ...
16673  10/27/2023          metro     373004  Chicago
16674  10/28/2023          metro     275006  Chicago
16675  10/29/2023          metro     185823  Chicago
16676  10/30/2023          metro     367453  Chicago
16677  10/31/2023          metro     390110  Chicago

[16678 rows x 4 columns]

In [13]:
ny_cleaned

           date  ridership city transport_type
0    01/01/2008    6453734  NYC          metro
1    02/01/2008    6144377  NYC          metro
2    03/01/2008    6602280  NYC          metro
3    04/01/2008    6787480  NYC          metro
4    04/01/2008   24900328  NYC            bus
..          ...        ...  ...            ...
643  01/01/2024    5490105  NYC          metro
644  01/01/2024     928328  NYC            bus
645  01/01/2024     189970  NYC          metro
646  01/01/2024   24912126  NYC            bus
647  01/01/2024   25395118  NYC            bus

[648 rows x 4 columns]

In [14]:
concatenated_df = pd.concat([ny_cleaned, ch_cleaned], ignore_index=True)
concatenated_df

             date  ridership     city transport_type
0      01/01/2008    6453734      NYC          metro
1      02/01/2008    6144377      NYC          metro
2      03/01/2008    6602280      NYC          metro
3      04/01/2008    6787480      NYC          metro
4      04/01/2008   24900328      NYC            bus
...           ...        ...      ...            ...
17321  10/27/2023     373004  Chicago          metro
17322  10/28/2023     275006  Chicago          metro
17323  10/29/2023     185823  Chicago          metro
17324  10/30/2023     367453  Chicago          metro
17325  10/31/2023     390110  Chicago          metro

[17326 rows x 4 columns]

In [15]:
concatenated_df.to_sql(name='monthly_totals', con=conn, index=False, if_exists='replace')

326

In [16]:
for transport in ['bus', 'metro']:
    query = f"""
    CREATE TABLE IF NOT EXISTS {transport}_monthly_totals as
    SELECT date, ridership, city
    FROM monthly_totals
    WHERE transport_type = '{transport}';
    """
    conn = engine.connect()
    conn.execute(text(query))